app/controllers/transactions_controller.rb

SELECT "transactions".* FROM "transactions" ORDER BY "transactions"."occurred_on" DESC, "transactions"."created_at" DESC
---
  def index
    # 依發生日期由新到舊排序，同日期再以建立時間排序，方便檢視最近的記錄
    @transactions = Transaction.order(occurred_on: :desc, created_at: :desc)

INSERT INTO "transactions" ("amount", "kind", "occurred_on", "category", "note", "created_at", "updated_at") VALUES (52996, 'income', '2026-06-01', '', '', '2026-06-20 07:35:38.142483', '2026-06-20 07:35:38.142483') RETURNING "id"
---
  def create
    @transaction = Transaction.new(transaction_params)

    if @transaction.save